# SetVPClOvrdFillStyle

## Description
```pascal
PROCEDURE SetVPClOvrdFillStyle(
				viewportHandle : HANDLE;
				className      : STRING;
				fillStyle      : LONGINT);
```

```python

def vs.SetVPClOvrdFillStyle(viewportHandle, className, fillStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle|
|className|STRING|The name of the class|
|fillStyle|LONGINT|The fill style to be set|

## Version
Availability: from Vectorworks 2018
## Category
* Viewports